In [1]:
import pandas as pd
from datetime import datetime

In [3]:
df=pd.read_csv("C:/Users/acer/Desktop/employee.csv")

In [4]:
df

   EmployeeID   Department  Salary JoiningDate
0         101           HR   50000    03-15-18
1         102      Finance   65000    07-20-19
2         103  Engineering   85000    01-10-16
3         104           HR   55000    11-05-20
4         105      Finance   70000    08-25-17

In [5]:
df['JoiningDate'] = pd.to_datetime(df['JoiningDate'])

In [6]:
S=df['Salary'].max()

In [7]:
df.loc[df[df['Salary'] == S].index,'Department']

2    Engineering
Name: Department, dtype: object

In [8]:
df.groupby("Department")["Salary"].mean()

Department
Engineering    85000.0
Finance        67500.0
HR             52500.0
Name: Salary, dtype: float64

In [9]:
average_salary = df.groupby("Department")["Salary"].mean()
print("Average Salary by Department:")
print(average_salary)

Average Salary by Department:
Department
Engineering    85000.0
Finance        67500.0
HR             52500.0
Name: Salary, dtype: float64

In [10]:
#department with the highest average salary
highest_avg_dept = df.loc[[df['Salary'].idxmax()],'Department']
print(f"\nDepartment with the highest average salary: {highest_avg_dept}")

Department with the highest average salary: 2    Engineering
Name: Department, dtype: object

In [11]:
highest_avg_dept = average_salary.idxmax()
print(f"\nDepartment with the highest average salary: {highest_avg_dept}")

Department with the highest average salary: Engineering

In [12]:
current=datetime.now()

In [17]:
df['Experience']=df['JoiningDate'].apply(lambda x: current.year - x.year - ((current.month, current.day) < (x.month, x.day)))

In [18]:
df

   EmployeeID   Department  Salary JoiningDate  Experience
0         101           HR   50000  2018-03-15           6
1         102      Finance   65000  2019-07-20           5
2         103  Engineering   85000  2016-01-10           8
3         104           HR   55000  2020-11-05           4
4         105      Finance   70000  2017-08-25           7

In [20]:
df[df['Experience']>5]

   EmployeeID   Department  Salary JoiningDate  Experience
0         101           HR   50000  2018-03-15           6
2         103  Engineering   85000  2016-01-10           8
4         105      Finance   70000  2017-08-25           7

# Sales Data

In [21]:
df=pd.read_csv("C:/Users/acer/Desktop/salesdata.csv")

In [22]:
df

   TransactionID   Product     Category  Price        Date
0              1     Shoes     Clothing    100  15-01-2024
1              2  T-Shirts     Clothing     50  10-02-2024
2              3      Bags  Accessories    200  05-03-2024
3              4     Shoes     Clothing    150  20-01-2024
4              5  T-Shirts     Clothing     70  15-02-2024
5              6      Bags  Accessories    250  12-03-2024
6              7     Shoes     Clothing    120  25-01-2024

In [23]:
X=df.groupby('Product')['Price'].sum()

In [24]:
X[X>5000]

Series([], Name: Price, dtype: int64)

In [25]:
df.groupby('Category')['Price'].mean()

Category
Accessories    225.0
Clothing        98.0
Name: Price, dtype: float64

In [26]:
df['Date']=pd.to_datetime(df['Date'])

C:\Users\acer\AppData\Local\Temp\ipykernel_15328\3023999556.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  df['Date']=pd.to_datetime(df['Date'])

In [27]:
df

   TransactionID   Product     Category  Price       Date
0              1     Shoes     Clothing    100 2024-01-15
1              2  T-Shirts     Clothing     50 2024-10-02
2              3      Bags  Accessories    200 2024-05-03
3              4     Shoes     Clothing    150 2024-01-20
4              5  T-Shirts     Clothing     70 2024-02-15
5              6      Bags  Accessories    250 2024-12-03
6              7     Shoes     Clothing    120 2024-01-25

In [28]:
df['Month']=df['Date'].dt.month

In [29]:
df

   TransactionID   Product     Category  Price       Date  Month
0              1     Shoes     Clothing    100 2024-01-15      1
1              2  T-Shirts     Clothing     50 2024-10-02     10
2              3      Bags  Accessories    200 2024-05-03      5
3              4     Shoes     Clothing    150 2024-01-20      1
4              5  T-Shirts     Clothing     70 2024-02-15      2
5              6      Bags  Accessories    250 2024-12-03     12
6              7     Shoes     Clothing    120 2024-01-25      1

In [30]:
df.groupby('Month')['Price'].sum()

Month
1     370
2      70
5     200
10     50
12    250
Name: Price, dtype: int64

In [36]:
#Icategory which has the highest total sales for each month
sales_by_category_month=df.groupby(["Month", "Category"])['Price'].sum().unstack()
sales_by_category_month

Category  Accessories  Clothing
Month
1                 NaN     370.0
2                 NaN      70.0
5               200.0       NaN
10                NaN      50.0
12              250.0       NaN

In [32]:
sales_by_category_month.idxmax(axis=1)

Month
1        Clothing
2        Clothing
5     Accessories
10       Clothing
12    Accessories
dtype: object

In [33]:
df['Year']=df['Date'].dt.year

In [34]:
df

   TransactionID   Product     Category  Price       Date  Month  Year
0              1     Shoes     Clothing    100 2024-01-15      1  2024
1              2  T-Shirts     Clothing     50 2024-10-02     10  2024
2              3      Bags  Accessories    200 2024-05-03      5  2024
3              4     Shoes     Clothing    150 2024-01-20      1  2024
4              5  T-Shirts     Clothing     70 2024-02-15      2  2024
5              6      Bags  Accessories    250 2024-12-03     12  2024
6              7     Shoes     Clothing    120 2024-01-25      1  2024

# Sales Data-2

In [1]:
import pandas as pd
df=pd.read_csv("C:/Users/acer/Downloads/archive/sales_data_sample.csv", encoding='latin1')

In [2]:
df

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2818,10350,20,100.00,15,2244.40,12/2/2004 0:00,Shipped,4,12,2004,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Small
2819,10373,29,100.00,1,3978.51,1/31/2005 0:00,Shipped,1,1,2005,...,Torikatu 38,NaN,Oulu,NaN,90110,Finland,EMEA,Koskitalo,Pirkko,Medium
2820,10386,43,100.00,4,5417.57,3/1/2005 0:00,Resolved,1,3,2005,...,"C/ Moralzarzal, 86",NaN,Madrid,NaN,28034,Spain,EMEA,Freyre,Diego,Medium
2821,10397,34,62.24,1,2116.16,3/28/2005 0:00,Shipped,1,3,2005,...,1 rue Alsace-Lorraine,NaN,Toulouse,NaN,31000,France,EMEA,Roulet,Annette,Small
2822,10414,47,65.52,9,3079.44,5/6/2005 0:00,On Hold,2,5,2005,...,8616 Spinnaker Dr.,NaN,Boston,MA,51003,USA,NaN,Yoshido,Juri,Medium

In [7]:
df.describe()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,QTR_ID,MONTH_ID,YEAR_ID,MSRP
count,2823.000000,2823.000000,2823.000000,2823.000000,2823.000000,2823.000000,2823.000000,2823.00000,2823.000000
mean,10258.725115,35.092809,83.658544,6.466171,3553.889072,2.717676,7.092455,2003.81509,100.715551
std,92.085478,9.741443,20.174277,4.225841,1841.865106,1.203878,3.656633,0.69967,40.187912
min,10100.000000,6.000000,26.880000,1.000000,482.130000,1.000000,1.000000,2003.00000,33.000000
25%,10180.000000,27.000000,68.860000,3.000000,2203.430000,2.000000,4.000000,2003.00000,68.000000
50%,10262.000000,35.000000,95.700000,6.000000,3184.800000,3.000000,8.000000,2004.00000,99.000000
75%,10333.500000,43.000000,100.000000,9.000000,4508.000000,4.000000,11.000000,2004.00000,124.000000
max,10425.000000,97.000000,100.000000,18.000000,14082.800000,4.000000,12.000000,2005.00000,214.000000

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 263 entries, 10 to 2808
Data columns (total 24 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ORDERNUMBER       263 non-null    int64
 1   QUANTITYORDERED   263 non-null    int64
 2   PRICEEACH         263 non-null    float64
 3   ORDERLINENUMBER   263 non-null    int64
 4   SALES             263 non-null    float64
 5   ORDERDATE         263 non-null    object
 6   STATUS            263 non-null    object
 7   QTR_ID            263 non-null    int64
 8   MONTH_ID          263 non-null    int64
 9   YEAR_ID           263 non-null    int64
 10  PRODUCTLINE       263 non-null    object
 11  MSRP              263 non-null    int64
 12  PRODUCTCODE       263 non-null    object
 13  CUSTOMERNAME      263 non-null    object
 14  PHONE             263 non-null    object
 15  ADDRESSLINE1      263 non-null    object
 16  CITY              263 non-null    object
 17  STATE             263 non-null    object
 18  POSTALCODE        263 non-null    object
 19  COUNTRY           263 non-null    object
 20  TERRITORY         263 non-null    object
 21  CONTACTLASTNAME   263 non-null    object
 22  CONTACTFIRSTNAME  263 non-null    object
 23  DEALSIZE          263 non-null    object
dtypes: float64(2), int64(7), object(15)
memory usage: 51.4+ KB

In [18]:
df.isnull().value_counts()

ORDERNUMBER  QUANTITYORDERED  PRICEEACH  ORDERLINENUMBER  SALES  ORDERDATE  STATUS  QTR_ID  MONTH_ID  YEAR_ID  PRODUCTLINE  MSRP   PRODUCTCODE  CUSTOMERNAME  PHONE  ADDRESSLINE1  CITY   STATE  POSTALCODE  COUNTRY  TERRITORY  CONTACTLASTNAME  CONTACTFIRSTNAME  DEALSIZE
False        False            False      False            False  False      False   False   False     False    False        False  False        False         False  False         False  False  False       False    False      False            False             False       263
dtype: int64

In [12]:
df.drop('ADDRESSLINE2',axis=1,inplace=True)

In [14]:
df.dropna(axis=0,inplace=True)

In [19]:
df.groupby(['ORDERNUMBER','DEALSIZE'])['SALES'].sum()
#df.groupby('ORDERNUMBER')['SALES'].sum()

ORDERNUMBER  DEALSIZE
10120        Large        9264.86
             Medium      18632.27
             Small       22500.53
10125        Medium       9738.18
10139        Large        7956.46
             Medium      15102.23
             Small        5338.57
10148        Medium      34127.20
             Small       13064.56
10152        Medium       4524.10
             Small        6116.19
10169        Medium      26801.75
             Small       14990.20
10174        Large        8014.82
             Medium      16889.76
             Small        2194.22
10193        Medium      14566.68
             Small       23311.87
10210        Medium      22371.85
             Small       28118.79
10223        Large        9774.03
             Medium      20921.58
             Small       18941.96
10232        Medium      18473.04
             Small        8433.64
10240        Medium      17114.43
10258        Large        7680.64
             Medium      15762.64
             Small        2485.47
10265        Large        8427.02
             Medium       3907.80
10270        Medium      31672.47
             Small        9624.67
10316        Medium      26907.87
             Small       24426.29
10339        Large       10758.00
             Medium      18212.10
             Small       26918.55
10342        Medium      36082.69
             Small        7696.40
10347        Medium      39256.18
             Small        8186.73
10361        Medium      23592.82
             Small       14312.33
10370        Large        8470.14
             Medium      11020.74
             Small       10361.29
10372        Large        7031.52
             Medium      27636.20
             Small        3523.67
10374        Medium      17648.09
             Small        4081.94
10391        Large        8344.71
             Medium      14588.98
             Small       12226.56
10408        Small         553.95
10415        Medium       9279.65
             Small        5098.44
10420        Medium      32891.83
             Small       11079.60
Name: SALES, dtype: float64

In [20]:
#df[['ORDERNUMBER','SALES']].sort_values(by='SALES').max()
revenue_per_order = df.groupby('ORDERNUMBER')['SALES'].sum().reset_index()
revenue_per_order.loc[revenue_per_order['SALES'].idxmax()]

ORDERNUMBER    10339.00
SALES          55888.65
Name: 16, dtype: float64

In [21]:
df['ORDERDATE']=pd.to_datetime(df['ORDERDATE'])

In [22]:
df['month']=df['ORDERDATE'].dt.month

In [23]:
df

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE,month
10,10223,37,100.00,1,3965.66,2004-02-20,Shipped,1,2,2004,...,636 St Kilda Road,Melbourne,Victoria,3004,Australia,APAC,Ferguson,Peter,Medium,2
21,10361,20,72.55,13,1451.00,2004-12-17,Shipped,4,12,2004,...,"Monitor Money Building, 815 Pacific Hwy",Chatswood,NSW,2067,Australia,APAC,Huxley,Adrian,Small,12
32,10174,34,100.00,4,8014.82,2003-11-06,Shipped,4,11,2003,...,31 Duncan St. West End,South Brisbane,Queensland,4101,Australia,APAC,Calaghan,Tony,Large,11
39,10258,32,100.00,6,7680.64,2004-06-15,Shipped,2,6,2004,...,2-2-8 Roppongi,Minato-ku,Tokyo,106-0032,Japan,Japan,Shimamura,Akiko,Large,6
40,10270,21,100.00,9,4905.39,2004-07-19,Shipped,3,7,2004,...,"Monitor Money Building, 815 Pacific Hwy",Chatswood,NSW,2067,Australia,APAC,Huxley,Adrian,Medium,7
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2787,10316,34,43.70,12,1485.80,2004-11-01,Shipped,4,11,2004,...,Garden House Crowther Way,Cowes,Isle of Wight,PO31 7PJ,UK,EMEA,Bennett,Helen,Small,11
2789,10339,27,76.31,6,2060.37,2004-11-23,Shipped,4,11,2004,...,2-2-8 Roppongi,Minato-ku,Tokyo,106-0032,Japan,Japan,Shimamura,Akiko,Small,11
2791,10361,23,95.20,12,2189.60,2004-12-17,Shipped,4,12,2004,...,"Monitor Money Building, 815 Pacific Hwy",Chatswood,NSW,2067,Australia,APAC,Huxley,Adrian,Small,12
2796,10415,42,57.61,3,2419.62,2005-05-09,Disputed,2,5,2005,...,7 Allen Street,Glen Waverly,Victoria,3150,Australia,APAC,Connery,Sean,Small,5
2808,10232,24,49.69,3,1192.56,2004-03-20,Shipped,1,3,2004,...,Garden House Crowther Way,Cowes,Isle of Wight,PO31 7PJ,UK,EMEA,Bennett,Helen,Small,3

In [25]:
df.groupby(['month','DEALSIZE'])['SALES'].sum()

month  DEALSIZE
1      Large         59263.22
       Medium       497052.22
       Small        229559.00
2      Large        106246.58
       Medium       514926.54
       Small        189268.78
3      Large         94357.41
       Medium       465477.94
       Small        194666.04
4      Large        182094.60
       Medium       317833.75
       Small        169462.61
5      Large        168948.20
       Medium       531276.65
       Small        223747.71
6      Large         49948.88
       Medium       290806.45
       Small        114001.45
7      Large         73413.33
       Medium       303749.10
       Small        137713.54
8      Large         57571.76
       Medium       424575.13
       Small        177163.68
9      Large         81548.22
       Medium       319833.42
       Small        183342.63
10     Large        117003.26
       Medium       714676.46
       Small        289535.50
11     Large        254632.54
       Medium      1289716.25
       Small        574536.88
12     Large         57091.26
       Medium       417508.33
       Small        160079.53
Name: SALES, dtype: float64